cases/05_navier_stokes_equation/11_lid_driven_cavity_projection_Re3200_hybrid80/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /    O  peration     |
    \  /    A nd           |
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application projectionFoamStudent;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 150;
deltaT 0.0005;
writeControl runTime;
writeInterval 1;
purgeWrite 0;
writeFormat ascii;
writePrecision 12;
timePrecision 12;
writeCompression off;
runTimeModifiable no;
maxCo 0.2;

// 稳态控制：
//     max |Uⁿ - Uⁿ⁻¹| <= steadyVelocityTol
//     max |div(Uⁿ)|   <= steadyMassTol
// 两个条件连续满足 requiredSteadySteps 次，且至少推进
// minimumSteadySteps 个时间步后，求解器才提前结束。
steadyStateControl true;
steadyVelocityTol 1e-06;
steadyMassTol 1e-08;
minimumSteadySteps 1000;
requiredSteadySteps 20;
